app/controllers/entries_controller.rb

  def index
    @entries = ActiveModel::ArraySerializer.new(
      Entry.all,
      each_serializer: Entries::EntrySerializer,
      root: false).
      as_json
---
SELECT "entries".* FROM "entries"

  def create
    @entries = Entry.new(entry_service.parse_timesheet_entry_info(entry_params))
    respond_to do |format|
      if @entries.save
---
INSERT INTO "entries" ("start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["start_date", "2021-08-27 20:44:00"], ["end_date", "2021-08-27 22:46:00"], ["created_at", "2021-08-28 10:57:58.973041"], ["updated_at", "2021-08-28 10:57:58.973041"]]