app/models/entry.rb

SELECT "entries".* FROM "entries" WHERE ("entries"."start_date" BETWEEN ? AND ? OR "entries"."end_date" BETWEEN ? AND ?)  [["start_date", "2019-04-15 11:00:00"], ["start_date", "2019-04-15 16:33:00"], ["end_date", "2019-04-15 11:00:00"], ["end_date", "2019-04-15 16:33:00"]]
---
  def time_overlapping
    errors.add(:base, :overlap) if Entry.where(start_date: start_date..end_date).
      or(Entry.where(end_date: start_date..end_date)).present?